fix: うまく表示されたので1-2ににも展開
